MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1937/mcu.h
extern volatile LCDDATA5bits_t LCDDATA5bits __at(0x7A5);
// bitfield macros
#define _LCDDATA5_SEG16COM1_POSN                            0x0
#define _LCDDATA5_SEG16COM1_POSITION                        0x0
#define _LCDDATA5_SEG16COM1_SIZE                            0x1
#define _LCDDATA5_SEG16COM1_LENGTH                          0x1
#define _LCDDATA5_SEG16COM1_MASK                            0x1
#define _LCDDATA5_SEG17COM1_POSN                            0x1
#define _LCDDATA5_SEG17COM1_POSITION                        0x1
#define _LCDDATA5_SEG17COM1_SIZE                            0x1
#define _LCDDATA5_SEG17COM1_LENGTH                          0x1
#define _LCDDATA5_SEG17COM1_MASK                            0x2
#define _LCDDATA5_SEG18COM1_POSN                            0x2
#define _LCDDATA5_SEG18COM1_POSITION                        0x2
#define _LCDDATA5_SEG18COM1_SIZE                            0x1
#define _LCDDATA5_SEG18COM1_LENGTH                          0x1
#define _LCDDATA5_SEG18COM1_MASK                            0x4
#define _LCDDATA5_SEG19COM1_POSN                            0x3
#define _LCDDATA5_SEG19COM1_POSITION                        0x3
#define _LCDDATA5_SEG19COM1_SIZE                            0x1
#define _LCDDATA5_SEG19COM1_LENGTH                          0x1
#define _LCDDATA5_SEG19COM1_MASK                            0x8
#define _LCDDATA5_SEG20COM1_POSN                            0x4
#define _LCDDATA5_SEG20COM1_POSITION                        0x4
#define _LCDDATA5_SEG20COM1_SIZE                            0x1
#define _LCDDATA5_SEG20COM1_LENGTH                          0x1
#define _LCDDATA5_SEG20COM1_MASK                            0x10
#define _LCDDATA5_SEG21COM1_POSN                            0x5
#define _LCDDATA5_SEG21COM1_POSITION                        0x5
#define _LCDDATA5_SEG21COM1_SIZE                            0x1
#define _LCDDATA5_SEG21COM1_LENGTH                          0x1
#define _LCDDATA5_SEG21COM1_MASK                            0x20
#define _LCDDATA5_SEG22COM1_POSN                            0x6
#define _LCDDATA5_SEG22COM1_POSITION                        0x6
#define _LCDDATA5_SEG22COM1_SIZE                            0x1
#define _LCDDATA5_SEG22COM1_LENGTH                          0x1
#define _LCDDATA5_SEG22COM1_MASK                            0x40
#define _LCDDATA5_SEG23COM1_POSN                            0x7
#define _LCDDATA5_SEG23COM1_POSITION                        0x7
#define _LCDDATA5_SEG23COM1_SIZE                            0x1
#define _LCDDATA5_SEG23COM1_LENGTH                          0x1
#define _LCDDATA5_SEG23COM1_MASK                            0x80

// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
extern volatile unsigned char           LCDDATA6            __at(0x7A6);
#ifndef _LIB_BUILD
asm("LCDDATA6 equ 07A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0COM2               :1;
        unsigned SEG1COM2               :1;
        unsigned SEG2COM2               :1;
        unsigned SEG3COM2               :1;
        unsigned SEG4COM2               :1;
        unsigned SEG5COM2               :1;
        unsigned SEG6COM2               :1;
        unsigned SEG7COM2               :1;
    };
} LCDDATA6bits_t;
extern volatile LCDDATA6bits_t LCDDATA6bits __at(0x7A6);
// bitfield macros
#define _LCDDATA6_SEG0COM2_POSN                             0x0
#define _LCDDATA6_SEG0COM2_POSITION                         0x0
#define _LCDDATA6_SEG0COM2_SIZE                             0x1
#define _LCDDATA6_SEG0COM2_LENGTH                           0x1
#define _LCDDATA6_SEG0COM2_MASK                             0x1
#define _LCDDATA6_SEG1COM2_POSN                             0x1
#define _LCDDATA6_SEG1COM2_POSITION                         0x1
#define _LCDDATA6_SEG1COM2_SIZE                             0x1
#define _LCDDATA6_SEG1COM2_LENGTH                           0x1
#define _LCDDATA6_SEG1COM2_MASK                             0x2
#define _LCDDATA6_SEG2COM2_POSN                             0x2
#define _LCDDATA6_SEG2COM2_POSITION                         0x2
#define _LCDDATA6_SEG2COM2_SIZE                             0x1
#define _LCDDATA6_SEG2COM2_LENGTH                           0x1
#define _LCDDATA6_SEG2COM2_MASK                             0x4
#define _LCDDATA6_SEG3COM2_POSN                             0x3
#define _LCDDATA6_SEG3COM2_POSITION                         0x3
#define _LCDDATA6_SEG3COM2_SIZE                             0x1
#define _LCDDATA6_SEG3COM2_LENGTH                           0x1
#define _LCDDATA6_SEG3COM2_MASK                             0x8
#define _LCDDATA6_SEG4COM2_POSN                             0x4
#define _LCDDATA6_SEG4COM2_POSITION                         0x4
#define _LCDDATA6_SEG4COM2_SIZE                             0x1
#define _LCDDATA6_SEG4COM2_LENGTH                           0x1
#define _LCDDATA6_SEG4COM2_MASK                             0x10
#define _LCDDATA6_SEG5COM2_POSN                             0x5
#define _LCDDATA6_SEG5COM2_POSITION                         0x5
#define _LCDDATA6_SEG5COM2_SIZE                             0x1
#define _LCDDATA6_SEG5COM2_LENGTH                           0x1
#define _LCDDATA6_SEG5COM2_MASK                             0x20
#define _LCDDATA6_SEG6COM2_POSN                             0x6
#define _LCDDATA6_SEG6COM2_POSITION                         0x6
#define _LCDDATA6_SEG6COM2_SIZE                             0x1
#define _LCDDATA6_SEG6COM2_LENGTH                           0x1
#define _LCDDATA6_SEG6COM2_MASK                             0x40
#define _LCDDATA6_SEG7COM2_POSN                             0x7
#define _LCDDATA6_SEG7COM2_POSITION                         0x7
#define _LCDDATA6_SEG7COM2_SIZE                             0x1
#define _LCDDATA6_SEG7COM2_LENGTH                           0x1
#define _LCDDATA6_SEG7COM2_MASK                             0x80

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
extern volatile unsigned char           LCDDATA7            __at(0x7A7);
#ifndef _LIB_BUILD
asm("LCDDATA7 equ 07A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8COM2               :1;
        unsigned SEG9COM2               :1;
        unsigned SEG10COM2              :1;
        unsigned SEG11COM2              :1;
        unsigned SEG12COM2              :1;
        unsigned SEG13COM2              :1;
        unsigned SEG14COM2              :1;
        unsigned SEG15COM2              :1;
    };
} LCDDATA7bits_t;
extern volatile LCDDATA7bits_t LCDDATA7bits __at(0x7A7);
// bitfield macros
#define _LCDDATA7_SEG8COM2_POSN                             0x0
#define _LCDDATA7_SEG8COM2_POSITION                         0x0
#define _LCDDATA7_SEG8COM2_SIZE                             0x1
#define _LCDDATA7_SEG8COM2_LENGTH                           0x1
#define _LCDDATA7_SEG8COM2_MASK                             0x1
#define _LCDDATA7_SEG9COM2_POSN                             0x1
#define _LCDDATA7_SEG9COM2_POSITION                         0x1
#define _LCDDATA7_SEG9COM2_SIZE                             0x1
#define _LCDDATA7_SEG9COM2_LENGTH                           0x1
#define _LCDDATA7_SEG9COM2_MASK                             0x2
#define _LCDDATA7_SEG10COM2_POSN                            0x2
#define _LCDDATA7_SEG10COM2_POSITION                        0x2
#define _LCDDATA7_SEG10COM2_SIZE                            0x1
#define _LCDDATA7_SEG10COM2_LENGTH                          0x1
#define _LCDDATA7_SEG10COM2_MASK                            0x4
#define _LCDDATA7_SEG11COM2_POSN                            0x3
#define _LCDDATA7_SEG11COM2_POSITION                        0x3
#define _LCDDATA7_SEG11COM2_SIZE                            0x1
#define _LCDDATA7_SEG11COM2_LENGTH                          0x1
#define _LCDDATA7_SEG11COM2_MASK                            0x8
#define _LCDDATA7_SEG12COM2_POSN                            0x4
#define _LCDDATA7_SEG12COM2_POSITION                        0x4
#define _LCDDATA7_SEG12COM2_SIZE                            0x1
#define _LCDDATA7_SEG12COM2_LENGTH                          0x1
#define _LCDDATA7_SEG12COM2_MASK                            0x10
#define _LCDDATA7_SEG13COM2_POSN                            0x5
#define _LCDDATA7_SEG13COM2_POSITION                        0x5
#define _LCDDATA7_SEG13COM2_SIZE                            0x1
#define _LCDDATA7_SEG13COM2_LENGTH                          0x1
#define _LCDDATA7_SEG13COM2_MASK                            0x20
#define _LCDDATA7_SEG14COM2_POSN                            0x6
#define _LCDDATA7_SEG14COM2_POSITION                        0x6
#define _LCDDATA7_SEG14COM2_SIZE                            0x1
#define _LCDDATA7_SEG14COM2_LENGTH                          0x1
#define _LCDDATA7_SEG14COM2_MASK                            0x40
#define _LCDDATA7_SEG15COM2_POSN                            0x7
#define _LCDDATA7_SEG15COM2_POSITION                        0x7
#define _LCDDATA7_SEG15COM2_SIZE                            0x1
#define _LCDDATA7_SEG15COM2_LENGTH                          0x1
#define _LCDDATA7_SEG15COM2_MASK                            0x80

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
extern volatile unsigned char           LCDDATA8            __at(0x7A8);
#ifndef _LIB_BUILD
asm("LCDDATA8 equ 07A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16COM2              :1;
        unsigned SEG17COM2              :1;
        unsigned SEG18COM2              :1;
        unsigned SEG19COM2              :1;
        unsigned SEG20COM2              :1;
        unsigned SEG21COM2              :1;
        unsigned SEG22COM2              :1;
        unsigned SEG23COM2              :1;
    };
} LCDDATA8bits_t;
extern volatile LCDDATA8bits_t LCDDATA8bits __at(0x7A8);
// bitfield macros
#define _LCDDATA8_SEG16COM2_POSN                            0x0
#define _LCDDATA8_SEG16COM2_POSITION                        0x0
#define _LCDDATA8_SEG16COM2_SIZE                            0x1
#define _LCDDATA8_SEG16COM2_LENGTH                          0x1
#define _LCDDATA8_SEG16COM2_MASK                            0x1
#define _LCDDATA8_SEG17COM2_POSN                            0x1
#define _LCDDATA8_SEG17COM2_POSITION                        0x1
#define _LCDDATA8_SEG17COM2_SIZE                            0x1
#define _LCDDATA8_SEG17COM2_LENGTH                          0x1
#define _LCDDATA8_SEG17COM2_MASK                            0x2
#define _LCDDATA8_SEG18COM2_POSN                            0x2
#define _LCDDATA8_SEG18COM2_POSITION                        0x2
#define _LCDDATA8_SEG18COM2_SIZE                            0x1
#define _LCDDATA8_SEG18COM2_LENGTH                          0x1
#define _LCDDATA8_SEG18COM2_MASK                            0x4
#define _LCDDATA8_SEG19COM2_POSN                            0x3
#define _LCDDATA8_SEG19COM2_POSITION                        0x3
#define _LCDDATA8_SEG19COM2_SIZE                            0x1
#define _LCDDATA8_SEG19COM2_LENGTH                          0x1
#define _LCDDATA8_SEG19COM2_MASK                            0x8
#define _LCDDATA8_SEG20COM2_POSN                            0x4
#define _LCDDATA8_SEG20COM2_POSITION                        0x4
#define _LCDDATA8_SEG20COM2_SIZE                            0x1
#define _LCDDATA8_SEG20COM2_LENGTH                          0x1
#define _LCDDATA8_SEG20COM2_MASK                            0x10
#define _LCDDATA8_SEG21COM2_POSN                            0x5
#define _LCDDATA8_SEG21COM2_POSITION                        0x5
#define _LCDDATA8_SEG21COM2_SIZE                            0x1
#define _LCDDATA8_SEG21COM2_LENGTH                          0x1
#define _LCDDATA8_SEG21COM2_MASK                            0x20
#define _LCDDATA8_SEG22COM2_POSN                            0x6
#define _LCDDATA8_SEG22COM2_POSITION                        0x6
#define _LCDDATA8_SEG22COM2_SIZE                            0x1
#define _LCDDATA8_SEG22COM2_LENGTH                          0x1
#define _LCDDATA8_SEG22COM2_MASK                            0x40
#define _LCDDATA8_SEG23COM2_POSN                            0x7
#define _LCDDATA8_SEG23COM2_POSITION                        0x7
#define _LCDDATA8_SEG23COM2_SIZE                            0x1
#define _LCDDATA8_SEG23COM2_LENGTH                          0x1
#define _LCDDATA8_SEG23COM2_MASK                            0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0x7A9);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 07A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0COM3               :1;
        unsigned SEG1COM3               :1;
        unsigned SEG2COM3               :1;
        unsigned SEG3COM3               :1;
        unsigned SEG4COM3               :1;
        unsigned SEG5COM3               :1;
        unsigned SEG6COM3               :1;
        unsigned SEG7COM3               :1;
    };
} LCDDATA9bits_t;
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0x7A9);
// bitfield macros
#define _LCDDATA9_SEG0COM3_POSN                             0x0
#define _LCDDATA9_SEG0COM3_POSITION                         0x0
#define _LCDDATA9_SEG0COM3_SIZE                             0x1
#define _LCDDATA9_SEG0COM3_LENGTH                           0x1
#define _LCDDATA9_SEG0COM3_MASK                             0x1
#define _LCDDATA9_SEG1COM3_POSN                             0x1
#define _LCDDATA9_SEG1COM3_POSITION                         0x1
#define _LCDDATA9_SEG1COM3_SIZE                             0x1
#define _LCDDATA9_SEG1COM3_LENGTH                           0x1
#define _LCDDATA9_SEG1COM3_MASK                             0x2
#define _LCDDATA9_SEG2COM3_POSN                             0x2
#define _LCDDATA9_SEG2COM3_POSITION                         0x2
#define _LCDDATA9_SEG2COM3_SIZE                             0x1
#define _LCDDATA9_SEG2COM3_LENGTH                           0x1
#define _LCDDATA9_SEG2COM3_MASK                             0x4
#define _LCDDATA9_SEG3COM3_POSN                             0x3
#define _LCDDATA9_SEG3COM3_POSITION                         0x3
#define _LCDDATA9_SEG3COM3_SIZE                             0x1
#define _LCDDATA9_SEG3COM3_LENGTH                           0x1
#define _LCDDATA9_SEG3COM3_MASK                             0x8
#define _LCDDATA9_SEG4COM3_POSN                             0x4
#define _LCDDATA9_SEG4COM3_POSITION                         0x4
#define _LCDDATA9_SEG4COM3_SIZE                             0x1
#define _LCDDATA9_SEG4COM3_LENGTH                           0x1
#define _LCDDATA9_SEG4COM3_MASK                             0x10
#define _LCDDATA9_SEG5COM3_POSN                             0x5
#define _LCDDATA9_SEG5COM3_POSITION                         0x5
#define _LCDDATA9_SEG5COM3_SIZE                             0x1
#define _LCDDATA9_SEG5COM3_LENGTH                           0x1
#define _LCDDATA9_SEG5COM3_MASK                             0x20
#define _LCDDATA9_SEG6COM3_POSN                             0x6
#define _LCDDATA9_SEG6COM3_POSITION                         0x6
#define _LCDDATA9_SEG6COM3_SIZE                             0x1
#define _LCDDATA9_SEG6COM3_LENGTH                           0x1
#define _LCDDATA9_SEG6COM3_MASK                             0x40
#define _LCDDATA9_SEG7COM3_POSN                             0x7
#define _LCDDATA9_SEG7COM3_POSITION                         0x7
#define _LCDDATA9_SEG7COM3_SIZE                             0x1
#define _LCDDATA9_SEG7COM3_LENGTH                           0x1
#define _LCDDATA9_SEG7COM3_MASK                             0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0x7AA);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 07AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8COM3               :1;
        unsigned SEG9COM3               :1;
        unsigned SEG10COM3              :1;
        unsigned SEG11COM3              :1;
        unsigned SEG12COM3              :1;
        unsigned SEG13COM3              :1;
        unsigned SEG14COM3              :1;
        unsigned SEG15COM3              :1;
    };
} LCDDATA10bits_t;
